APC10x4.7/4000RPM/prepDirs/10mps4000rpmPre/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;
    libs          (forces);

    writeControl  timeStep;
    timeInterval  200;

    patches       ("hub");
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        1.225;          // Redundant for incompressible

    CofR          (0 0 0);    // Rotation around centre line of propeller
    pitchAxis     (1 0 0);
}



// ************************************************************************* //
